module.exports = {
  extends: ['@commitlint/config-conventional'],
  rules: {
    'type-enum': [
      2,
      'always',
      [
        'feat', // (Feature) การเพิ่มฟีเจอร์ใหม่ให้กับโปรเจกต์ เช่น ฟังก์ชันใหม่ หรือคุณสมบัติใหม่
        'fix', // (Bug fix) แก้ไขบั๊กหรือข้อผิดพลาดที่พบในโค้ด
        'docs', // (Documentation) การอัปเดตเอกสาร เช่น การเพิ่มคำแนะนำ หรือปรับปรุงการอธิบาย
        'chore', // (Chore) งานที่ไม่เกี่ยวข้องกับฟีเจอร์หรือบั๊ก เช่น การอัปเดต dependency, การตั้งค่าเครื่องมือ, หรือการจัดระเบียบโค้ด
        'style', // (Code style) การปรับแต่งรูปแบบโค้ด เช่น การเว้นวรรค, การจัดเรียงบรรทัด, การใช้เครื่องหมายคำพูดคู่หรือเดี่ยว โดยไม่กระทบการทำงานของโค้ด
        'refactor', // (Refactoring) การปรับปรุงโค้ดที่มีอยู่แล้ว โดยไม่เปลี่ยนแปลงพฤติกรรมของโปรแกรม เช่น การทำให้โค้ดอ่านง่ายขึ้น
        'ci', // (Continuous Integration) การเปลี่ยนแปลงที่เกี่ยวข้องกับการตั้งค่า CI/CD เช่น การอัปเดตการตั้งค่าในไฟล์ `ci.yml`
        'test', // (Test) การเพิ่มหรือปรับปรุงการทดสอบ เช่น การเขียน unit test หรือการแก้ไข test ที่มีปัญหา
        'perf', // (Performance) การเปลี่ยนแปลงเพื่อเพิ่มประสิทธิภาพของแอปพลิเคชัน เช่น การปรับปรุงเวลาในการโหลด หรือการเพิ่มประสิทธิภาพการทำงาน
        'revert', // (Revert) การย้อนกลับการเปลี่ยนแปลงที่ทำไปก่อนหน้านี้ เช่น การยกเลิก commit ที่ทำให้เกิดปัญหาหรือบั๊ก
      ],
    ],
  },
};
